# VelocityPressure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..VelocityPressure Property
Connector Class See Also
---
The velocity pressure of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double VelocityPressure { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VelocityPressure As Double
	Get
```

Visual C++
---
```text
public:
property double VelocityPressure {
	double get ();
}
```

# Remarks
Instantaneous velocity pressure of this connector,calculated according to system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This connector does not support flow calculation and associated properties. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace